{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If this notebook is inside a container, you will need to enable connection with the host\n",
    "\n",
    "<!-- https://forums.docker.com/t/accessing-host-machine-from-within-docker-container/14248/4 -->\n",
    "`docker network create -d bridge --subnet 192.168.0.0/24 --gateway 192.168.0.1 dockernet`\n",
    "\n",
    "`docker run -p 8888:8888 --net=dockernet  -v \"$PWD\":/home/jovyan datasci`\n",
    "\n",
    "I am also running Neo4j from a container:\n",
    "\n",
    "`docker run --publish=7474:7474 --publish=7687:7687 --volume=$HOME/neo4j/data:/data --env=NEO4J_AUTH=none neo4j`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: py2neo in /opt/conda/lib/python3.6/site-packages (4.3.0)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.6/site-packages (from py2neo) (2018.6)\n",
      "Requirement already satisfied: urllib3<1.25,>=1.23 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.23)\n",
      "Requirement already satisfied: click==7.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (7.0)\n",
      "Requirement already satisfied: neobolt~=1.7.12 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.7.16)\n",
      "Requirement already satisfied: pygments~=2.3.1 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2.3.1)\n",
      "Requirement already satisfied: colorama in /opt/conda/lib/python3.6/site-packages (from py2neo) (0.4.3)\n",
      "Requirement already satisfied: certifi in /opt/conda/lib/python3.6/site-packages (from py2neo) (2018.10.15)\n",
      "Requirement already satisfied: neotime~=1.7.4 in /opt/conda/lib/python3.6/site-packages (from py2neo) (1.7.4)\n",
      "Requirement already satisfied: prompt-toolkit~=2.0.7 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2.0.10)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from neotime~=1.7.4->py2neo) (1.11.0)\n",
      "Requirement already satisfied: wcwidth in /opt/conda/lib/python3.6/site-packages (from prompt-toolkit~=2.0.7->py2neo) (0.1.7)\n"
     ]
    }
   ],
   "source": [
    "!pip install py2neo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://neo4j.com/developer/docker/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4.3.0\n"
     ]
    }
   ],
   "source": [
    "# https://py2neo.org/v4/\n",
    "import py2neo\n",
    "print(py2neo.__version__)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph,Node,Relationship"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "the reason the IP is 192.168.0.1 is because the Neo4j instance is in a container and we are connecting over a Docker network"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph =  Graph(\"http://192.168.0.1:7474/db/data/\",secure=False)\n",
    "#graph =  Graph(\"http://localhost:7474/db/data/\",bolt=False,secure=False)\n",
    "#graph =  Graph(\"http://localhost:7474/db/data/\",username='neo4j',secure=False)\n",
    "#graph =  Graph(\"http://neo4j:password@localhost:7474/db/data/\") # https://stackoverflow.com/questions/39667425/py2neo-socketerror-connection-refused-but-curl-works"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "mary = Node(\"Person\",name=\"Mary\",primary_key='name',primary_label='Person')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.create(mary)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a few CYPHER queries that are in Python functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def print_distinct_labels(graph):\n",
    "    query=\"\"\"\n",
    "    match (n)\n",
    "    return distinct labels (n)\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record labels (n)=['Person']>\n"
     ]
    }
   ],
   "source": [
    "print_distinct_labels(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "def how_many_nodes(graph):\n",
    "    query=\"\"\"\n",
    "    match (n)\n",
    "    return count (n)\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count (n)=1>\n"
     ]
    }
   ],
   "source": [
    "how_many_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "def print_all_nodes(graph):\n",
    "    query=\"\"\"\n",
    "    MATCH (n) \n",
    "    RETURN n limit 100\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=(_17556:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})>\n"
     ]
    }
   ],
   "source": [
    "print_all_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = Node('Person',primary_label=\"Person\", name=\"Alice\",primary_key=5358)\n",
    "b = Node('Person',primary_label=\"Person\", name=\"Bob\",primary_key='name')\n",
    "ab = Relationship(a, \"KNOWS\", b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(:Person {name: 'Alice', primary_key: 5358, primary_label: 'Person'})"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.push(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=(_17556:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})>\n"
     ]
    }
   ],
   "source": [
    "print_all_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "tx = graph.begin()\n",
    "tx.merge(a,\"Role\",\"name\") #node,label,primary key\n",
    "tx.merge(b,\"Person\",\"name\") #node,label,pirmary key\n",
    "tx.create(ab) #tx.merge(ab)\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.evaluate(\"MATCH (a:Person) RETURN count(a)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://gist.github.com/MarneeDear/f15693b799a6085de5653daf4e39a886\n",
    "\n",
    "https://neo4j.com/blog/py2neo-3-1-python-driver-neo4j/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
